# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- File Management & Transfer ---
cask "forklift"
cask "transmit"

# --- Web Development ---
cask "mamp"

# --- Editors & AI Tools ---
cask "claude"
cask "claude-code"
cask "visual-studio-code"
cask "cursor"

# --- Infrastructure & Database ---
cask "docker"
cask "postman"
cask "tableplus"

# --- System Utilities ---
cask "1password"
cask "raycast"
cask "cleanshot"
cask "appcleaner"
cask "karabiner-elements"
cask "google-japanese-ime"

# --- Communication & Collaboration ---
cask "slack"
cask "chatwork"
cask "zoom"
cask "notion"

# --- Terminal ---
cask "iterm2"

# --- Core Tools ---
brew "curl"
brew "wget"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "bat"
brew "zoxide"

# --- Development ---
brew "git"
brew "git-lfs"
brew "gh"
brew "ghq"
brew "mise"
brew "go-task"
brew "make"

# --- Terminal Environment ---
brew "neovim"
brew "sheldon"
brew "starship"

# --- Monitoring & Notification ---
brew "htop"
brew "mactop"
brew "terminal-notifier"

# --- Media ---
brew "ffmpeg"

# --- AWS Tools ---
brew "awscli"
brew "s5cmd"

# --- VS Code / Cursor Extensions ---
# --- Theme & UI (Kanagawa & Material Icons) ---
vscode "SimonHo.kanagawa-paper"
vscode "pkief.material-icon-theme"
vscode "oderwat.indent-rainbow"
vscode "shardulm94.trailing-spaces"
vscode "Gruntfuggly.todo-tree"

# --- PHP (CakePHP / WordPress / Core) ---
vscode "DEVSENSE.phptools-vscode"          # PHP IntelliSense & Refactoring
vscode "DEVSENSE.intelli-php-vscode"       # Smart AI completion for PHP
vscode "DEVSENSE.profiler-php-vscode"      # PHP Profiler
vscode "bmewburn.vscode-intelephense-client" # Advanced PHP static analysis
vscode "xdebug.php-debug"                  # Xdebug support

# --- HTML & CSS & Frontend ---
vscode "formulahendry.auto-rename-tag"     # 開始タグ変更時に終了タグを同期
vscode "formulahendry.auto-close-tag"      # タグの自動閉じ
vscode "ecmel.vscode-html-css"             # HTMLクラス名の補完
vscode "pranaygp.vscode-css-peek"          # HTMLからCSS定義へジャンプ
vscode "ritwickdey.LiveServer"             # 静的ファイルのリアルタイムプレビュー
vscode "xabikos.JavaScriptSnippets"        # モダンJSのスニペット
vscode "esbenp.prettier-vscode"            # コード整形 (CSS/JS用)
vscode "adpyke.vscode-sql-formatter"       # SQLの整形
vscode "yusukehirao.vscode-markuplint"     # 日本発のHTML Linter

# --- Markdown & Documentation ---
vscode "yzhang.markdown-all-in-one"        # Markdown執筆の効率化

# --- Git & Infrastructure ---
vscode "eamodio.gitlens"                   # 強力なGit履歴追跡
vscode "ms-vsliveshare.vsliveshare"        # ペアプロ用
vscode "Natizyskunk.sftp"                  # 旧来のサーバー同期 (WP案件用)
vscode "tamasfe.even-better-toml"          # dotfiles (toml) の編集サポート

# --- Tooling & AI ---
vscode "github.copilot"                    # AI補完
vscode "vincaslt.highlight-matching-tag"   # 対になるタグの強調
vscode "christian-kohler.path-intellisense" # パスの自動補完
