tap "homebrew/bundle"

# --- File Management & Transfer ---
cask "forklift"
cask "transmit"
cask "cyberduck"

# --- Web Development ---
cask "servbay"
cask "mamp"

# --- Editors & AI Tools ---
cask "claude"
cask "claude-code"
cask "visual-studio-code"
cask "cursor"

# --- Infrastructure & Database ---
cask "docker"
cask "postman"
cask "tableplus"

# --- System Utilities ---
cask "1password"
cask "raycast"
cask "cleanshot"
cask "appcleaner"
cask "karabiner-elements"
cask "google-japanese-ime"

# --- Communication & Collaboration ---
cask "slack"
cask "chatwork"
cask "zoom"
cask "notion"

# --- Terminal ---
cask "iterm2"

# --- Core Tools ---
brew "curl"
brew "wget"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "bat"
brew "zoxide"

# --- Development ---
brew "git"
brew "git-lfs"
brew "gh"
brew "ghq"
brew "mise"
brew "go-task"
brew "make"

# --- Terminal Environment ---
brew "neovim"
brew "sheldon"
brew "starship"

# --- Monitoring & Notification ---
brew "htop"
brew "mactop"
brew "terminal-notifier"

# --- Media ---
brew "ffmpeg"
